nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxa577/common/pin_mux/pin_mux.c
    gpio_pin_config_t gpio3_pinH13_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_20 (pin H13)  */
    GPIO_PinInit(GPIO3, 20U, &gpio3_pinH13_config);

    gpio_pin_config_t gpio3_pinH10_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_21 (pin H10)  */
    GPIO_PinInit(GPIO3, 21U, &gpio3_pinH10_config);

    gpio_pin_config_t gpio4_pinG3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO4_0 (pin G3)  */
    GPIO_PinInit(GPIO4, 0U, &gpio4_pinG3_config);

    gpio_pin_config_t gpio4_pinH4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO4_3 (pin H4)  */
    GPIO_PinInit(GPIO4, 3U, &gpio4_pinH4_config);

    gpio_pin_config_t gpio4_pinJ1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO4_4 (pin J1)  */
    GPIO_PinInit(GPIO4, 4U, &gpio4_pinJ1_config);

    gpio_pin_config_t gpio4_pinJ4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO4_5 (pin J4)  */
    GPIO_PinInit(GPIO4, 5U, &gpio4_pinJ4_config);

    gpio_pin_config_t gpio4_pinK1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_6 (pin K1)  */
    GPIO_PinInit(GPIO4, 6U, &gpio4_pinK1_config);

    gpio_pin_config_t gpio4_pinJ2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO4_7 (pin J2)  */
    GPIO_PinInit(GPIO4, 7U, &gpio4_pinJ2_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFlexioCameraSmartdmaTrigger:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexioCameraSmartdmaTrigger
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlexioCameraSmartdmaTrigger(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitTenBaseT1SPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: A4, peripheral: T1S0, signal: t1s_tx, pin_signal: P1_2/TRIG_OUT0/LPSPI0_SDI/LPI2C1_SDAS/CT1_MAT0/CT_INP0/FLEXIO0_D10/ENET0_MDC/TENBASET1S_TX/CAN0_TXD/TSI0_CH14/ADC0_A18,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: A5, peripheral: T1S0, signal: t1s_rx, pin_signal: P1_0/WUU0_IN6/LPTMR0_ALT3/TRIG_IN0/LPSPI0_SDO/LPI2C1_SDA/CT_INP4/CT0_MAT2/FLEXIO0_D8/TENBASET1S_RX/CAN1_RXD/TSI0_CH12/ADC0_A16/CMP0_IN0,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable, input_buffer: enable, invert_input: normal}
  - {pin_num: B5, peripheral: T1S0, signal: t1s_ed, pin_signal: P1_1/TRIG_IN1/LPSPI0_SCK/LPI2C1_SCL/CT_INP5/CT0_MAT3/FLEXIO0_D9/TENBASET1S_ED/CAN1_TXD/TSI0_CH13/ADC0_A17,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTenBaseT1SPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitTenBaseT1SPins(void)
{
    /* PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* T1S0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kT1S0_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);
    /* ENET0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kENET0_RST_SHIFT_RSTn);

    const port_pin_config_t port1_0_pinA5_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = kPORT_LowDriveStrength,
                                                    /* Normal drive strength is configured */
                                                    .driveStrength1 = kPORT_NormalDriveStrength,
                                                    /* Pin is configured as TENBASET1S_RX */
                                                    .mux = kPORT_MuxAlt10,
                                                    /* Digital input enabled */
                                                    .inputBuffer = kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    .invertInput = kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = kPORT_UnlockRegister};
    /* PORT1_0 (pin A5) is configured as TENBASET1S_RX */
    PORT_SetPinConfig(PORT1, 0U, &port1_0_pinA5_config);

    const port_pin_config_t port1_1_pinB5_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = kPORT_LowDriveStrength,
                                                    /* Normal drive strength is configured */
                                                    .driveStrength1 = kPORT_NormalDriveStrength,
                                                    /* Pin is configured as TENBASET1S_ED */
                                                    .mux = kPORT_MuxAlt10,
                                                    /* Digital input enabled */
                                                    .inputBuffer = kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    .invertInput = kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = kPORT_UnlockRegister};
    /* PORT1_1 (pin B5) is configured as TENBASET1S_ED */
    PORT_SetPinConfig(PORT1, 1U, &port1_1_pinB5_config);

    const port_pin_config_t port1_2_pinA4_config = {/* Internal pull-up/down resistor is disabled */
                                                    .pullSelect = kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    .pullValueSelect = kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    .slewRate = kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    .openDrainEnable = kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    .driveStrength = kPORT_LowDriveStrength,
                                                    /* Normal drive strength is configured */
                                                    .driveStrength1 = kPORT_NormalDriveStrength,
                                                    /* Pin is configured as TENBASET1S_TX */
                                                    .mux = kPORT_MuxAlt10,
                                                    /* Digital input enabled */
                                                    .inputBuffer = kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    .invertInput = kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    .lockRegister = kPORT_UnlockRegister};
    /* PORT1_2 (pin A4) is configured as TENBASET1S_TX */
    PORT_SetPinConfig(PORT1, 2U, &port1_2_pinA4_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENETPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: B4, peripheral: ENET0, signal: enet_mdio, pin_signal: P1_3/WUU0_IN7/TRIG_OUT1/LPSPI0_PCS0/LPI2C1_SCLS/CT1_MAT1/CT_INP1/FLEXIO0_D11/ENET0_MDIO/CAN0_RXD/TSI0_CH15/ADC0_A19/CMP0_IN1}
  - {pin_num: A4, peripheral: ENET0, signal: enet_mdc, pin_signal: P1_2/TRIG_OUT0/LPSPI0_SDI/LPI2C1_SDAS/CT1_MAT0/CT_INP0/FLEXIO0_D10/ENET0_MDC/TENBASET1S_TX/CAN0_TXD/TSI0_CH14/ADC0_A18}
  - {pin_num: C1, peripheral: ENET0, signal: 'enet_rdata, 0', pin_signal: P1_11/WUU0_IN11/TRIG_OUT2/LPUART1_CTS_B/LPI2C2_SCLS/CT2_MAT1/FLEXIO0_D19/SMARTDMA_PIO7/LPUART5_RXD/ENET0_RXD0/TENBASET1S_RX/CAN0_RXD/TSI0_CH21/ADC1_A9}
  - {pin_num: D2, peripheral: ENET0, signal: 'enet_rdata, 1', pin_signal: P1_12/WUU0_IN12/LPI2C1_SDA/LPUART2_RXD/CT2_MAT2/LPSPI5_SDO/FLEXIO0_D20/SMARTDMA_PIO8/LPUART5_CTS_B/ENET0_RXD1/TENBASET1S_ED/CAN1_RXD/TSI0_CH22/ADC1_A10}
  - {pin_num: A2, peripheral: ENET0, signal: 'enet_tdata, 0', pin_signal: P1_6/TRIG_IN2/LPSPI0_PCS1/LPUART2_RTS_B/CT_INP6/CT4_MAT0/FLEXIO0_D14/SMARTDMA_PIO2/LPI2C4_SCL/ENET0_TXD0/I3C1_SDA2/CAN1_TXD/TSI0_CH18/ADC0_A22}
  - {pin_num: A1, peripheral: ENET0, signal: 'enet_tdata, 1', pin_signal: P1_7/WUU0_IN9/TRIG_OUT2/LPUART2_CTS_B/CT_INP7/CT4_MAT1/FLEXIO0_D15/SMARTDMA_PIO3/LPI2C4_SDA/ENET0_TXD1/I3C1_SDA1/CAN1_RXD/TSI0_CH19/ADC0_A23}
  - {pin_num: D1, peripheral: ENET0, signal: enet_rx_dv, pin_signal: P1_13/TRIG_IN3/LPI2C1_SCL/LPUART2_TXD/CT2_MAT3/LPSPI5_SCK/FLEXIO0_D21/SMARTDMA_PIO9/LPUART5_RTS_B/ENET0_RXDV/TENBASET1S_TX/CAN1_TXD/TSI0_CH23/ADC1_A11}
  - {pin_num: B3, peripheral: ENET0, signal: enet_tx_en, pin_signal: P1_5/FREQME_CLK_IN1/LPSPI0_PCS2/LPUART2_TXD/CT1_MAT3/FLEXIO0_D13/SMARTDMA_PIO1/LPI2C4_SCLS/ENET0_TXEN/I3C1_SDA3/TSI0_CH17/ADC0_A21/CMP0_IN3}
  - {pin_num: A3, peripheral: ENET0, signal: enet_tx_clk, pin_signal: P1_4/WUU0_IN8/FREQME_CLK_IN0/LPSPI0_PCS3/LPUART2_RXD/CT1_MAT2/FLEXIO0_D12/SMARTDMA_PIO0/LPI2C4_SDAS/ENET0_TX_CLK/TSI0_CH16/ADC0_A20/CMP0_IN2}
  - {pin_num: C2, peripheral: GPIO1, signal: 'GPIO, 10', pin_signal: P1_10/LPUART1_RTS_B/LPI2C2_SDAS/CT2_MAT0/FLEXIO0_D18/SMARTDMA_PIO6/LPUART5_TXD/CAN0_TXD/TSI0_CH20/ADC1_A8,
    direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

